Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/consumer_affairs/telecommunications_and_postal_services/mobile_telephone_networks_in_ireland.html.txt.tmx
Source language: en
Languages: ga

source: There are a number of telephone networks in Ireland
ga: Tá ceithre cinn de líonraí teileafóin phóca in Éirinn

source: Each mobile telephone network is operated by a different provider
ga: Soláthraí ar leith a ritheann gach ceann de na líonraí teileafóin phóca sin

source: In order for a mobile telephone service provider to gain access to the market, they must be licensed by the Commission for Communications Regulation (ComReg)
ga: Chun go mbeadh cead isteach sa mhargadh aige, ní mór do sholáthraí seirbhíse teileafóin phóca ceadúnas a bheith aige ón gCoimisiún um Rialáil Cumarsáide (ComReg)

source: Each of the mobile telephone service providers offers different packages to consumers
ga: Tairgíonn gach soláthraí seirbhíse teileafóin phóca ar leith pacáistí éagsúla don tomhaltóir

source: ComReg's website allows consumers to compare mobile phone charges across all operators
ga: Tá suíomh idirlín curtha le chéile ag ComReg a ligeann don tomhaltóir comparáid a dhéanamh idir táillí teileafóin phóca i measc na n-oibreoirí ar fad

source: The site assists consumers to select the optimum mobile phone package, based on their individual usage
ga: Cuidíonn an suíomh leis an tomhaltóir an pacáiste teileafóin phóca is fearr a roghnú, bunaithe ar an úsáid faoi leith ag an duine sin féin

source: If you buy a mobile phone you have a contract with the mobile phone service provider
ga: Má cheannaíonn tú fón póca, bíonn conradh agat le soláthraí seirbhíse teileafóin phóca

source: The type of contract depends on whether you choose a Pre-pay or Post-pay mobile telephone service:
ga: Braitheann cineál an chonartha ar an rogha a dhéanann tú idir seirbhís teileafóin phóca Réamhcheannacháin agus seirbhís Iarcheannaithe

source: • Pre-pay services means that you pay as you go and you buy credit on your phone from various outlets such as shops, bank machines and over the phone
ga: • Ciallaíonn seirbhís réamhcheannacháin go n-íocann duine de réir mar atáthar ag dul ar aghaidh, ag ceannach creidmheasa le cur ar an fón in ionaid ar nós siopa nó meaisín bainc nó ar an fón féin

source: • Post-pay service means that you receive a bill for all the calls that you make
ga: • Ciallaíonn seirbhís iarcheannaithe go bhfaigheann duine bille maidir leis na glaonna ar fad a bhíonn déanta aige/aici

source: Within these 2 different types of contract there are also many variations
ga: Taobh istigh den 2 chineál conartha sin, is iomaí rogha eile atá ann

source: When choosing a mobile phone package, ask yourself:
ga: Déan amach duit féin

source: • When do you expect to make most of your calls (at peak or off peak times)
ga: • cén t-am de lá is dócha a ndéanfaidh tú an chuid is mó de do chuid glaonna (le linn buaicamanna nó amanna seachbhuaice)

source: • Will you use SMS (short messaging service or text messaging) more than voice calls
ga: an mbainfidh tú úsáid as SMS (seirbhís ghearrtheachtaireachtaí nó teachtaireachtaí téacs) níos mó ná a bhainfidh as glaonna gutha

source: • Which service providers are being used by the people whom you are likely to be calling
ga: • cé na soláthraithe seirbhíse a úsáideann na daoine ar dócha gur orthu a bheidh tú ag glaoch

source: Peak and off-peak rates
ga: Buaicrátaí agus rátaí seachbhuaice

source: Peak times are normally during the day when most people and businesses are making calls
ga: Is iondúil gur i rith an lae, nuair a bhíonn an chuid is mó de na daoine agus de na gnólachtaí ag déanamh glaonna, a bhíonn na buaicamanna

source: Generally calls cost more during peak times
ga: Cosnaíonn glaonna níos mó le linn buaicamanna

source: Off peak rates are normally in the evenings, night and at weekends
ga: I rith an tráthnóna, san oíche agus ar an deireadh seachtaine a bhíonn rátaí seachbhuaice i bhfeidhm go hiondúil

source: Calls can cost less during these periods
ga: D’fhéadfadh glaonna a bheith i bhfad níos saoire le linn na dtréimhsí sin

source: Make sure you know the times and rates for peak and off peak as these may change with different mobile phone call packages
ga: Bí cinnte go mbíonn a fhios agat na hamanna éagsúla agus leibhéal na mbuaicrátaí agus na rátaí seachbhuaice ó ní gá gur mar a chéile a bheidís i gcás gach pacáiste do ghlaonna fóin phóca

source: Changing your mobile telephone service provider
ga: Athrú ar do sholáthróir seirbhíse fóin póca

source: It is possible to change from one service provider to another service provider and retain your existing mobile telephone number
ga: Is féidir a athrú ó sholáthróir seirbhíse amháin go dtí ceann eile soláthraí seirbhíse agus d'uimhir fóin phóca atá ann cheana féin a choimeád

source: However, before changing to a new service provider you should first check what contractual obligations you have to your existing service provider
ga: Mar sin féin, sula ag athrú go dtí soláthraí seirbhíse nua ba chóir duit seiceáil ar dtús cad a oibleagáidí conarthacha a bhfuil tú le do sholáthraí seirbhíse atá ann cheana féin

source: Under EU rules provision has been made to ensure that a consumer can move their number from one service provider to another within one working day
ga: Faoi rialacha an AE, tá soláthar déanta chun a chinntiú gur féidir le tomhaltóirí a n-uimhir bogadh ó sholáthraí seirbhíse go dtí ceann eile taobh istigh de lá oibre amháin

source: Remember that the mobile phone handset that you buy is protected under the Sale of Goods and Supply of Services Act, 1980
ga: Cuimhnigh go bhfuil cosaint maidir leis an ngléas fóin phóca a cheannaíonn tú faoin Acht um Dhíol Earraí agus Soláthar Seirbhísí, 1980

source: This means that any mobile telephone handset or other telecommunications item you buy should be
ga: Ciallaíonn sin gur chóir go mbeadh aon ghléas teileafóin phóca a cheannófá

source: • As described - on the marketing material or by the sales person
ga: • De réir an chur síos a thugtar air – ar an ábhar margaíochta nó ón lucht díolacháin

source: • Fit for its purpose (that is, suitable for using as a mobile telephone handset)
ga: • Infheidhme (.i. oiriúnach chun a úsáide mar ghléas teileafóin phóca)

source: • Of merchantable quality (that is, fit to be sold and used by a customer)
ga: acmhainn a dhíolta agus a úsáide ag an gcustaiméir a bheith ann)

source: If the handset or other piece of mobile equipment that you buy from a mobile phone service provider or other retailer becomes faulty you can return it and you can get a repair replacement or a refund
ga: Sa chás go n-éiríonn gléas fóin nó píosa eile den trealamh fón póca a cheannaíonn tú ó sholáthraí seirbhíse teileafóin phóca fabhtach is féidir leat é a thabhairt ar ais agus gléas eile a fháil ina ionad go gcuirtear caoi air nó aisíoc

source: The legislation does not specify what kind of redress the retailer has to give you but you should expect that it will be reasonable
ga: Ní shonraítear sa reachtaíocht an cineál cúitimh is gá don mhiondíoltóir a thabhairt duit ach ba cheart a bheith ag súil go mbeadh sé réasúnta

source: You can read about how to complain
ga: Tá cur síos ar an gcaoi le gearán a dhéanamh

source: If you have exhausted the complaints mechanism of the mobile phone service provider and you are still dissatisfied you can take your claim to the Small Claims Court
ga: Sa chás go bhfuil na deismireachtaí gearáin ar fad triáilte agat gan sásamh a fháil, is féidir leat an t-éileamh a dhéanamh le Cúirt na nÉileamh Beag

source: 4G is a term for fourth generation mobile telephone technology and follows on from 2G and 3G
ga: Téarma atá in 4G le haghaidh teicneolaíocht ghuthán póca den cheathrú glúin agus leanann sé ó 2G agus ó 3G

source: 2G technology was suitable for making calls and sending text messages while 3G makes it possible to access the internet more effectively through your mobile phone
ga: Bhí teicneolaíocht 2G oiriúnach chun glaonna a chur agus teachtaireachtaí téacs a sheoladh agus cuireann 3G ar chumas an t-idirlíon a rochtain níos éifeachtaí trí do ghuthán póca

source: 4G services should make it much quicker to surf the web on your mobile phone
ga: Ba cheart go mbeadh sé ní ba thapúla chun scimeáil a dhéanamh ar an ngréasán ar do ghuthán póca a bhuíochas le 4G

source: Mobile phone insurance like other types of insurance can insure the handset against loss, theft, etc
ga: Le hárachas teileafóin phóca, ar nós árachas de chineálacha eile, glactar árachas ar an sás láimhe in aghaidh chaillteanas, ghadaíocht, agus mar sin de

source: Many mobile insurance policies offer to protect your mobile in specific situations, such as accidental damage, from theft, loss, water damage, accidental damage and more
ga: Tairgítear le go leor polasaithe árachais theileafóin phóca cosaint a thabhairt do do theileafón póca in aghaidh dhamáiste de thimpiste, ó ghadaíocht, caillteanas, damáiste ó uisce, agus eile

source: Often when you purchase a mobile telephone, you may be asked whether you require mobile phone insurance
ga: Is minic agus teileafón póca á cheannach go bhfiafrófaí díot an raibh tú ag iarraidh árachas teileafóin phóca

source: Check the initial amount that you need to pay before the insurance company will pay for any loss or damage to insured items
ga: Seiceáil an tsuim a bheadh le híoc agat féin ar dtús sula n-íocfadh an comhlacht árachais thusa maidir le haon chaillteanas nó damáiste d’earra faoi árachas

source: This initial amount you must pay is called the excess
ga: An farasbarr a thugtar ar an tsuim sin a chaitheann tú féin a íoc ar dtús

source: If you have home and contents insurance for your home the theft of your mobile phone may be covered by that insurance – you can check this with your insurance company
ga: Má tá árachas agat ar an teach agus a bhfuil ann, d’fhéadfadh go dtiocfadh goid an teileafóin phóca faoin árachas sin – is féidir é a sheiceáil leis an gcomhlacht árachais

source: If your service provider allows you to use your mobile phone when you travel you can be charged roaming rates
ga: Má cheadaíonn do sholáthraí seirbhíse duit do ghuthán póca a úsáid nuair a thaistealaíonn tú, féadtar rátaí fánaíochta a ghearradh ort

source: Roaming is the ability to use your mobile phone while abroad
ga: Is ionann fánaíocht agus an cumas chun do ghuthán póca a úsáid fad a bhíonn tú thar lear

source: You should be aware that the charges for using your phone when roaming are different to the rates charged when making calls at home
ga: Ba cheart go mbeifeá ar an eolas go mbíonn na muirir a ghearrtar ar do ghuthán a úsáid fad a bhíonn tú ag fánaíocht éagsúil ó na rátaí a ghearrtar nuair a chuirtear glaonna sa bhaile

source: There is a cap on the price you can be charged for using your mobile phone while travelling in the EU
ga: Leagtar caidhp ar an bpraghas is féidir a ghearradh ort as do ghuthán póca a úsáid fad a thaistealaíonn tú san AE

source: The cap on price only applies when roaming within the EU
ga: Ní bhaineann an chaidhp a leagtar ar an bpraghas ach amháin nuair a bhíonn tú ag fánaíocht laistigh den AE

source: It is advisable to contact your service provider in advance of travelling abroad to see what charges will apply if you use your phone in another country
ga: Moltar duit teagmháil a dhéanamh le do sholáthraí seirbhíse sula dtaistealaíonn tú thar lear féachaint cén muirir a ghearrfar má úsáideann tú do ghuthán i dtír eile

source: You can read more information about mobile phone roaming on ComReg's website
ga: Féadfaidh tú breis faisnéise a léamh faoi fhánaíocht guthán póca ar a láithreán gréasáin ComReg, askcomreg.ie

source: Roaming charges from 30 April 2016
ga: Muirir fánaíochta ón 30 Aibreán 2016

source: There is an EU agreement to abolish roaming charges from 15 June 2017
ga: Rinneadh comhaontú san AE chun deireadh a chur le muirir fánaíochta ón 15 Meitheamh 2017

source: A transitional period will be in force from 30 April 2016 to 15 June 2017
ga: Beidh idirthréimhse i gceist ón 30 Aibreán 2016 go dtí an 15 Meitheamh 2017

source: During this transitional period, mobile operators may charge their customers an extra fee (a surcharge) for roaming on top of their domestic price
ga: I rith na hidirthréimhse seo, féadfaidh oibreoirí soghluaiste táille bhreise (formhuirear) a ghearradh ar a gcustaiméirí ar fhánaíocht anuas ar a bpraghas intíre

source: However, these surcharges are capped
ga: Leagtar caidhp ar na formhuirir seo, áfach

source: Roaming charges abolished from 15 June 2017
ga: Billí idirlíon fánaíochta guthán póca

source: Mobile phone operators must provide their customers with a cut-off spending limit of €50 (excluding VAT) a month on their internet surfing bill when roaming within the EU, although a customer can opt for a higher limit
ga: Ní mór d'oibreoirí guthán póca teorainn scoite a chur ar fáil nuair a chaitear €50 (gan CBL a áireamh) sa mhí ar a mbille scimeála idirlín nuair a bhíonn siad i mbun fánaíochta san AE, ach is féidir le custaiméir teorainn níos airde a roghnú

source: When 80% of the cash limit has been reached, the operator has to warn you that you are approaching the limit and will be cut off, unless that limit is changed
ga: Nuair a bhíonn 80% den teorainn airgid arna baint amach, tá ar an oibreoir rabhadh a thabhairt duit go bhfuil tú ag druidim leis an teorainn agus go gcuirfear stop leis an idirlíon, mura n-athraítear an teorainn sin

source: Since 1 July 2012, these measures also apply when roaming outside the EU
ga: Ón 1 Iúil 2012, tá na bearta seo i gceist freisin nuair atáthar i mbun fánaíochta lasmuigh den AE

source: Since 1 July 2014, you will be able to use a separate roaming services provider while continuing to use the same handset and phone number
ga: Ón 1 Iúil 2014, beidh tú in ann soláthróir ar leith seirbhísí fánaíochta a úsáid agus tú ag leanúint leis an nguthán agus an uimhir ghutháin chéanna a úsáid

source: More information is available on the EU Commission's website
ga: Tá níos mó faisnéise ar fáil ar láithreán gréasáin Choimisiún an Aontais Eorpaigh

source: If your phone is stolen
ga: Sa chás go ngoidtear an fón ort

source: Every handset sold has a unique number called an IMEI (International Mobile Equipment Identification) number
ga: Tá uimhir dó féin ag gach sás láimhe a dhíoltar ar a dtugtar IMEI (Aitheantóir Idirnáisiúnta Fóin Póca)

source: Record this information and register it with your mobile phone service provider when you buy the handset
ga: Coinnigh tuairisc ar an eolas sin agus cláraigh leis an soláthraí seirbhíse teileafóin phóca atá agat é nuair a cheannaíonn tú an sás láimhe

source: If your phone is stolen report the theft immediately to the Gardaí and your mobile phone service provider who can then ensure that the phone is made unusable on all networks
ga: Sa chás go ngoidtear an fón ort, tabhair tuairisc maidir leis an ngoid do na Gardaí agus don soláthraí seirbhíse theileafón póca gan mhoill agus féadfar cinntiú nach n-oibreoidh an fón ar líonra ar bith

source: Contact your mobile phone service provider for further information on this scheme
ga: Déan teagmháil leis an soláthraí seirbhíse theileafón póca maidir le tuilleadh eolais faoin scéim seo

source: Children and mobile phones
ga: Leanaí agus fóin phóca

source: Many children in Ireland and abroad use mobile phones
ga: Úsáideann go leor leanaí in Éirinn agus thar lear fóin phóca

source: Modern mobile phones are means by which the internet can be accessed and can be used to transmit video and other images which may or may not be appropriate for children
ga: Is féidir an t-idirlíon a cheadú trí mheán fóin phóca nua-aimseartha chomh maith le hábhar físe nó íomhánna a sheoladh a d’fhéadfadh a bheith oiriúnach nó mí-oiriúnach do leanaí

source: The Irish Cellular Industry Association has published A parent's guide to mobile phones (pdf) which explains good practice with regard to mobile phone use for children
ga: Tá treoir dar teideal A parent’s guide to mobile phones (pdf) foilsithe ag The Irish Cellular Industry Association ina mínítear an dea-chleachtas maidir le húsáid fóin phóca ag leanaí

source: The Internet Service Providers Association of Ireland in association with the Office for Internet Safety operates a website www.hotline.ie where you can report instances of child pornography that you may come across. Making a complaint
ga: Tá suíomh idirlín www.hotline.ie bunaithe ag The Internet Service Providers Association of Ireland i gcomhar leis an Oifig Shábháilteachta Idirlín ar féidir tuairisc a thabhairt ar chásanna ina dtagtar trasna ar phornagrafaíocht leanaí

source: Different service providers charge different rates for mobile service packages – it is up to you to research the different rates and to see where you can get best value for money for the services that you use
ga: Gearrann soláthraithe seirbhíse éagsúla rátaí éagsúla ar na pacáistí seirbhísí fóin phóca – is fút féin atá na rátaí éagsúla a fhiosrú agus an margadh is fearr a aimsiú do na seirbhísí a úsáideann tú

source: If you have a problem with your mobile phone handset and you fail to get satisfaction from the retailer where you bought your mobile phone you can go to the Small Claims Court
ga: Sa chás go mbíonn deacracht agat leis an sás láimhe agus nach n-éiríonn leat sásamh a fháil ón miondíoltóir ónar cheannaigh tú an fón póca, is féidir leat dul go dtí Cúirt na nÉileamh Beag
